{
  "id": "task-011",
  "created": "2025-11-11T17:43:45Z",
  "updated": "2025-11-12T01:15:00Z",
  "title": "Implement TCP logging server on host machine",
  "status": "open",
  "priority": "high",
  "description": "Create TCP server on host machine to receive and acknowledge log entries and heartbeats from device. Server listens on configured port, receives JSON-line messages from device, outputs to stdout/file, and sends acknowledgments for both log entries and heartbeats. Receives entries without ts field (timestamps are null or calculated based on NTP sync status). This is the server-side of the bidirectional TCP logging and monitoring system.",
  "assigned_to": null,
  "acceptance_criteria": [
    "TCP server listens on configurable port (default 5000)",
    "Accepts connections from device (192.168.0.4 or configurable)",
    "Receives JSON-line format log messages: {\"boot_seq\":3,\"uptime_ms\":45000,\"seq\":42,\"level\":\"...\",\"msg\":\"...\",\"ts\":null|\"...\",\"system\":{...}}\n",
    "Receives heartbeat messages: {\"boot_seq\":3,\"uptime_ms\":45000,\"ts\":null|\"...\",\"type\":\"heartbeat\",\"system\":{...}} with system stats",
    "ts field is either valid ISO 8601 timestamp (if device had NTP sync on that boot) or null (unresolvable due to no sync)",
    "Parses and displays each log entry and heartbeat in real-time to stdout",
    "Sends acknowledgment for both log entries AND heartbeats: {\"ack\":1}",
    "Ack confirms bidirectional connection is working",
    "Log entries include system stats: heap_free, heap_used, uptime_ms, free_psram, task_count, spiffs_free, spiffs_used",
    "Log entries include boot sequencing info: boot_seq and seq for ordering",
    "Can filter/display entries by boot_seq to correlate logs from same boot cycle",
    "Send commands to device: {\"cmd\":\"status\"} - JSON-line format",
    "Detect cmd_response entries in received logs: {\"cmd_response\":true} indicates command was executed",
    "Bidirectional: server sends commands, device responds via log entries (detected by cmd_response field)",
    "Handles device disconnects gracefully, logs reconnect events",
    "Output can be piped to file, grep, other tools",
    "Timeouts on unresponsive connections",
    "Clean shutdown without crashes"
  ],
  "investigation": [
    {
      "timestamp": "2025-11-12T01:50:00Z",
      "action": "Discussed timestamp and NTP sync architecture with user",
      "finding": "Protocol: per-entry JSON messages with system stats and boot sequencing, per-entry TCP acks (for both logs and heartbeats), no batching. No ts field in transmission from device—calculated on send or set to null if boot never synced NTP. boot_seq + seq provides perfect ordering across reboots. Heartbeats every 1s idle validate bidirectional connection. Commands sent as JSON-line, responses received as log entries (cmd_response=true). Server is receiver/acknowledger/commander. SPIFFS on device handles persistence and circular buffering at 80%. Network task (device) handles all reconnection logic."
    }
  ],
  "solution": {
    "approach": "Simple Python TCP server listening on port 5000. Receives JSON-line messages from device (both log entries and heartbeats with calculated or null ts), parses them, outputs formatted to stdout (can show ts as provided, or 'unresolvable' if null), immediately sends {\"ack\":1} back to device. Accepts commands from stdin or API (e.g., 'status'), sends {\"cmd\":\"status\"} to device, detects responses via cmd_response field in received logs. Heartbeat acks serve as connection validation. Handles disconnects by logging them and waiting for reconnect.",
    "files_to_modify": [
      "host/tcp_log_server.py"
    ],
    "changes": "Create Python TCP server that: listens on port 5000, accepts device connection, reads JSON lines, distinguishes between log entries and heartbeats, parses boot_seq/seq/ts fields, prints human-readable format to stdout (handle null ts gracefully), sends ack back on each message. Additionally: accepts command input (status, etc), sends {\"cmd\":\"...\"}  to device, monitors incoming logs for cmd_response field to match responses. Handles reconnects gracefully."
  },
  "verification": null,
  "blockers": [],
  "related_tasks": ["task-007", "task-012"],
  "tags": [
    "logging",
    "tcp",
    "network",
    "host-side",
    "python"
  ]
}
